In [20]:
import pandas as pd

names = ["ali","hasan","hossein","maryam"]
ages = [18, 19, 20,21]
genders = ["M","M","M","F"]

In [4]:
print(names)
print(type(names))
print(len(names))

['ali', 'hasan', 'hossein', 'maryam']
<class 'list'>
4

In [5]:
len(names) == len(ages)

True

In [8]:
ages = [18,19,20]

if len(names) == len(ages):
    print("hoora!")
else:
    print("oops")

oops

In [10]:
if type(names) == type(ages):
    print("hoora!")
else:
    print("oops")

hoora!

In [18]:
print(ages)

for age in ages:
    if age < 20:
        print("teenager")
    elif (age >= 20) & (age < 30):
        print("young")
    else:
        print("old")

[18, 19, 20, 10, 60]
teenager
teenager
young
teenager
old

In [17]:
ages.append(60)
ages

[18, 19, 20, 10, 60]

In [24]:
range(len(ages))

range(0, 4)

In [51]:
students = []
for i in range(len(ages)):
    students.append({"name":names[i],"age":ages[i],"gender":genders[i]})

students

[{'name': 'ali', 'age': 18, 'gender': 'M'},
 {'name': 'hasan', 'age': 19, 'gender': 'M'},
 {'name': 'hossein', 'age': 20, 'gender': 'M'},
 {'name': 'maryam', 'age': 21, 'gender': 'F'}]

In [52]:
df = pd.DataFrame(students)
df

      name  age gender
0      ali   18      M
1    hasan   19      M
2  hossein   20      M
3   maryam   21      F

In [35]:
df.sort_values("age",ascending=False)
# df.sort_values("age",ascending=False,inplace=True)

In [38]:
type(df)

pandas.core.frame.DataFrame

In [37]:
df["name"]

3     maryam
2    hossein
1      hasan
0        ali
Name: name, dtype: object

In [39]:
type(df["name"])

pandas.core.series.Series

In [43]:
df[["name","age"]]

      name  age
3   maryam   21
2  hossein   20
1    hasan   19
0      ali   18

In [44]:
type(df[["name","age"]])

pandas.core.frame.DataFrame

In [48]:
df1 = df
print("df1:")
df1

df1:

      name  age gender
3   maryam   21      F
2  hossein   20      M
1    hasan   19      M
0      ali   18      M

In [47]:
print("df:")
df

df:

      name  age gender
3   maryam   21      F
2  hossein   20      M
1    hasan   19      M
0      ali   18      M

In [54]:
df1.pop("gender")
df1

      name  age
0      ali   18
1    hasan   19
2  hossein   20
3   maryam   21

In [55]:
df

      name  age gender
0      ali   18      M
1    hasan   19      M
2  hossein   20      M
3   maryam   21      F

In [53]:
# get a new copy of a dataframe to prevent root changes
df1 = df.copy()

In [60]:
# slicing
# df[0,1]
df.iloc[0]

name      ali
age        18
gender      M
Name: 0, dtype: object

In [61]:
type(df.iloc[0])

pandas.core.series.Series

In [64]:
df["name"] == "hasan"

0    False
1     True
2    False
3    False
Name: name, dtype: bool

In [65]:
df[df["name"] == "hasan"]

    name  age gender
1  hasan   19      M